In [ ]:
# import libraries 
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [3]:
# load data 
city_df = pd.read_excel('../data/raw_data/City.xlsx')
continent_df = pd.read_excel('../data/raw_data/Continent.xlsx')
country_df = pd.read_excel('../data/raw_data/Country.xlsx')
item_df = pd.read_excel('../data/raw_data/Item.xlsx')
mode_df = pd.read_excel('../data/raw_data/Mode.xlsx')
region_df = pd.read_excel('../data/raw_data/Region.xlsx')
transac_df = pd.read_excel('../data/raw_data/Transaction.xlsx')
type_df = pd.read_excel('../data/raw_data/Type.xlsx')
updated_item_df = pd.read_excel('../data/raw_data/Updated_Item.xlsx')
user_df = pd.read_excel('../data/raw_data/User.xlsx')

In [4]:
# first look of city_df 
city_df.head()

   CityId      CityName  CountryId
0       0             -          0
1       1        Douala          1
2       2  South Region          1
3       3     N'Djamena          2
4       4        Kigali          3

In [5]:
# first look of continent_df 
continent_df.head()

   ContinentId            Continent
0            0                    -
1            1               Africa
2            2              America
3            3                 Asia
4            4  Australia & Oceania

In [6]:
# first look of country_df 
country_df.head()

   CountryId   Country  RegionId
0          0         -         0
1          1  Cameroon         1
2          2      Chad         1
3          3    Rwanda         1
4          4  Ethiopia         2

In [7]:
# first look of item_df 
item_df.head()

,AttractionId,AttractionCityId,AttractionTypeId,Attraction,AttractionAddress
0,369,1,13,Kuta Beach - Bali,Kuta
1,481,1,13,Nusa Dua Beach,"Semenanjung Nusa Dua, Nusa Dua 80517 Indonesia"
2,640,1,63,Sacred Monkey Forest Sanctuary,"Jl. Monkey Forest, Ubud 80571 Indonesia"
3,650,1,13,Sanur Beach,Sanur
4,673,1,13,Seminyak Beach,Seminyak

In [8]:
# first look of mode_df 
mode_df.head()

   VisitModeId VisitMode
0            0         -
1            1  Business
2            2   Couples
3            3    Family
4            4   Friends

In [9]:
# first look of region_df 
region_df.head()

            Region  RegionId  ContinentId
0                -         0            0
1   Central Africa         1            1
2      East Africa         2            1
3     North Africa         3            1
4  Southern Africa         4            1

In [10]:
# first look of transac_df 
transac_df.head()

,TransactionId,UserId,VisitYear,VisitMonth,VisitMode,AttractionId,Rating
0,3,70456,2022,10,2,640,5
1,8,7567,2022,10,4,640,5
2,9,79069,2022,10,3,640,5
3,10,31019,2022,10,3,640,3
4,15,43611,2022,10,2,640,3

In [11]:
# first look of type_df 
type_df.head()

   AttractionTypeId         AttractionType
0                 2          Ancient Ruins
1                10                Ballets
2                13                Beaches
3                19        Caverns & Caves
4                34  Flea & Street Markets

In [12]:
# first look of updated_item_df 
updated_item_df.head()

,AttractionId,AttractionCityId,AttractionTypeId,Attraction,AttractionAddress
0,369,1,13,Kuta Beach - Bali,Kuta
1,481,1,13,Nusa Dua Beach,"Semenanjung Nusa Dua, Nusa Dua 80517 Indonesia"
2,640,1,63,Sacred Monkey Forest Sanctuary,"Jl. Monkey Forest, Ubud 80571 Indonesia"
3,650,1,13,Sanur Beach,Sanur
4,673,1,13,Seminyak Beach,Seminyak

In [13]:
# first look of user_df 
user_df.head()

   UserId  ContinentId  RegionId  CountryId  CityId
0      14            5        20        155   220.0
1      16            3        14        101  3098.0
2      20            4        15        109  4303.0
3      23            1         4         22   154.0
4      25            3        14        101  3098.0

In [ ]:
# check shape